{
	"events": {
		"test0": {
			"name": "Early X-Mas Party",
			"presents": [
				"dildo"
			],
			"restraints": {
				"gag": {
					"level": "severe"
				}
			},
			"embed": {
				"description": "!USER is invited to an early x-mas party. Nobody mentions them what kind of party it is but they find out once they arrive.\nThe host start undressing slowly, gesturing the guests to join too. Everybody slowly get naked.\nThe host and one guest walk closer to !USER with red ribbons in their hands and ask if they want to help with wrapping up the gift.Not knowing how to respond, !USER nods as an answer.\nWithout any future explanation, they start wrapping the red ribbon around !USER's body, pulling it tight, restraining both !User's legs and arms.\nAs getting restrained was not enough, the host pushes a red gag between !USER's jaw and secures it behind their back.\nThey place a wrapped gift near !USER's wrapped body as they prepare to have fun with !USER.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922451950245670962/ych_xmasbdsm_ribbons_Cjr_17.png",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"test1": {
			"name": "Early X-Mas Party",
			"presents": [
				"dildo"
			],
			"embed": {
				"description": "!USER is invited to an early x-mas party. Nobody mentions them what kind of party it is but they find out once they arrive.\nThe host start undressing slowly, gesturing the guests to join too. Everybody slowly get naked.\nOnce everyone is naked the host explains they have eggnogs, condom and alot of booz. Additionally everyone is getting a gift but they should promise to open it on Christmas day.\nThey all nod even !USER as all of them prepare for an long night orgy.",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"assisting_with_decoration": {
			"name": "Assisting with decoration",
			"presents": [
				"puffy_cuffs"
			],
			"restraints": {
				"cuffs_arm": {
					"level": "christmas_lights"
				},
				"cuffs_leg": {
					"level": "christmas_lights"
				}
			},
			"embed": {
				"description": "!USER decides to help out a friend with setting up the decoration. Besides helping them, !User also decides to tease them by wearing minimum clothing, especially no pants. The teasing works, they annoyed that they can see but can't touch it.\nDuring installing the lights, !USER manages to entangle themselves with the wires. Pulls on them but the wires wont give up, trapping !USER in their misfortune.\nTheir friend laughs at the situation and with a grin on their face speaks up 'It seams i will get my early present.'. Moving slowly closer and placing a hand on one of !USER's leg, slowly moving it to middle of the crotch area, 'Don't worry, I will be gentle'.\nCought, for the helping hand you provided, your friend left a gift for you.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922457605736108072/ych_xmasbdsm_lights_Cjr_17.png",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"assisting_with_decoration2": {
			"name": "Assisting with decoration",
			"presents": [
				"puffy_cuffs"
			],
			"embed": {
				"description": "!USER decides to help out a friend with setting up the decoration. As !User was busy with setting up the decoration, their friend decides to tease them by wearing minimum clothing, especially no pants. It must be a real teas seeing your friend's ass curves and unable to touch it.\nDuring installing the lights, they manages to entangle themselves with the wires.\nHow the pages have turned. One moment ago they were teasing !USER and now they entangled and helpless against !USER.\nWhat will you do? Will you help them? Or have some fun with them before untying them?",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922457605736108072/ych_xmasbdsm_lights_Cjr_17.png",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"naughty_xmas": {
			"name": "Naughty Xmas",
			"presents": [
				"leg_warmers"
			],
			"embed": {
				"description": "!USER decides to have a surprise early xmas party with their roomate.\nWhile they gone, !USER dresses up in a lewd xmas themed dress. Green-red legwarmers, red skirt and shirt and a ribbon collar. As they hear the door opening, they quickly sit down near the christmas tree, with a big candy-cane ready to be used.\nCought, the next morning your roommate leaves besides you a present with the hint that they liked how you were dressed.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922457464371306536/ych_xmas_naughtyxmas_Cjr_17.png",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"naughty_xmas2": {
			"name": "Naughty Xmas",
			"presents": [
				"leg_warmers"
			],
			"embed": {
				"description": "\nWhile !USER was shopping, their roommate was preparing something. When !USER arrives home, they greeted with a surprise sight. Near the christmas tree, their roommate was sitting,dresses up in a lewd xmas themed dress. Green-red legwarmers, red skirt and shirt and a ribbon collar. They lift up the candy cane and place the tip between !USER's pants, dragging them closer to the tree and to the ground.\nThe next morning your roommate leaves besides you a present with the hint that they want you to wear it too as they had fun wearing it.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922457464371306536/ych_xmas_naughtyxmas_Cjr_17.png",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"naughty_bed": {
			"name": "Lets have a good night",
			"presents": [
				"leather_cuffs",
				"leather_muzzle"
			],
			"restraints": {
				"cuffs_arm": {
					"level": "front"
				},
				"cuffs_leg": {
					"level": "taut"
				},
				"gag": {
					"level": "severe"
				}
			},
			"embed": {
				"description": "!USER after loosing dare, they need to serve the winner for one night as a slave. At their place, the dom places on the bed the stuffs !USER needs to wear. Nervously !USER gets naked and inspect every item before putting them on. Struggles putting on the tight latex suit but once on !USER starts locking the leather restraints around their legs, arms, neck.\nHowever the dom reveals another item for !USER to wear, a leather muzzle to silence the slave and this time the dom puts it on.\nIn the morning, once able to move again, the dom places a gift in your paw and informs you the key to removing your gears is in the lobbies postal boxes. So you better hurry before everyone else starts waking up if you dont want to get caught in public wearing those.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922457849962049546/YCH_Sjr_3300x5000_suit.jpg",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"naughty_bed2": {
			"name": "Lets have a good night",
			"presents": [
				"condom"
			],
			"embed": {
				"description": "As the winner, !USER enforces the loser to be their slave for one night. !USER places on the bed what their slave needs to wear during he time. Nervously they get naked and inspect every item before putting them on. Struggling putting on the tight latex suit but once on they starts locking the leather restraints around their legs, arms, neck.\nHowever !USER reveals another thing their toy needs to wear, a leather muzzle to silence the slave and this time !USEr is going to secure it on.\nIn the morning !USER discovers that their one night slave left a gift in their postal box.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922457849962049546/YCH_Sjr_3300x5000_suit.jpg",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"begging": {
			"name": "begging",
			"presents": [
				"magic_wand",
				"chastity"
			],
			"restraints": {
				"mitts": {
					"level": "puppy"
				},
				"collar": {
					"level": "rubber"
				}
			},
			"embed": {
				"description": "While !USER is waiting for their friend to return back from quick shopping they start exploring their friend's room. In a box they discover toys, not your everyday toys but adult toys. Intrigued they decide to try some of them on. Once naked the first thing they try is a pink rubbery leg-wears, after that with embarrassment they try out the chastity device. As they trying on different things, they start imagining a scene. Intoxicated with their thoughts, @USER is eager to play it out. As such they put on a collar with the leash tied to a chair, imagining somebody holding it and lock their paws in mitts imagining they totally helpless against who ever is holding the leash. They start humping the floor, enjoying the feeling of helplessness.\nAt some point do to the urge to orgasm they stop and try to remove their restraints. However they find it unable to remove the mitts.\nTrapped in their own mistake, !USER decides to go on full, grabbing with their jaw a magic-wand and waiting for their friend to return.\nIts going to be such a big surprise for your friend, that they prepare 2  gifts for you the next day.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922459135235203122/begging1a_by_letsfalltogether-ddeeped.png",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"delivering_support": {
			"name": "Delivery Support",
			"presents": [
				"magic_wand",
				"chastity"
			],
			"restraints": {
				"mitts": {
					"level": "pony"
				},
				"collar": {
					"level": "latex"
				},
				"cuffs_leg": {
					"level": "taut"
				},
				"hood": {
					"level": "pony"
				},
				"gag": {
					"level": "extreme"
				},
				"blindfold": {
					"level": "paneled"
				}
			},
			"embed": {
				"description": "While reading the news, !USER found an AD for help wanted delivering christmas presents. Deciding this will be a great way spending their time, helping others to receive their gifts.\nWhile waiting in the interview room, !USER finds it out that the place is found in the lewd part of town, maybe the rest is cheap here. Even finds it more odd when in the dressing room they ordered to get naked and out the suit on from the locker. They find their costume to be fully shinny latex but !USER decides to ignore it and tries them on. After they fully dressed they start panicking that there is no pants, it must be a mistake. They ask one of the staff helping them get dressed and they inform !USER to not worry about it and they not ready yet.\nThe staff starts putting on the finishing touches. First a pair of pony mitts, tightly locked around !USER paws. A collar around their neck, locked also. Next some cuffs around their legs with chain between them.\n!USER decides its enough and wants to asks what's happening. As they open their jaw to speak, a head harness is pulled over their head with build in bridle and blindfold, quickly silencing and blinding !USER.\n!USER screams, demanding to be released but the bridle does its job well enough. As that was not enough, they feel something cold and metallic between their crotch. They are blind so they can't see it but can feel their private parts being squeezed by what ever it is. With a leash attached to their collars, they ordered to get down on all 4 as they dragged to who knows were.\nDon't worry, they promised to free you. Well they didn't say it will be before or after xmas but they did say you're getting a nice gift.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922457977116581918/1637935128.franset_124.jpg",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"party_butnotlikethis": {
			"name": "'Guest' to a party",
			"presents": [
				"leather_muzzle",
				"chastity"
			],
			"restraints": {
				"gag": {
					"level": "extreme"
				}
			},
			"embed": {
				"description": "!USER gets an invitation to go to a party downtown adult bar by their friends. Having nothing better to do, they accept the invitation and get dressed formally according to the invitation.\nArriving at the place, they choose the first door they see having any sort of activity. Once inside, they confused as this area has lots of lockers, like a school gym dressing room. One of the staff observers !USER confusion stare and tries helping them. First they suggest getting undressed, put everything in the locker and give the key to the staff. After that grab anything from the table.\n!USER does so and once at the table they ask about the small odd looking table. The staff says its a service table, used to share drinks. !USER says they want this to server drinks to heir friends as a thank you. Of course the staff helps them out but unaware to !USER they not going to be serving drinks to their friends as they imagined too as they mistaken the door. They did not entered the door for normal guests, they entered the door for employers and volunteers....\n!User keeps squirming as his/her friends keep laughing at them. Placing their drinks on !USER's back and slapping his/her ass.\nThe friend who invited you had a talk with the manager and they agreed once you freed, they will give you a gift. But they also agreed that you will server other guests too, till 6am.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922458283296583751/1548097415.liuthekitty775_zzzzzzzzzzz16.png",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"after_company_part": {
			"name": "After company hours party",
			"presents": [
				"gag",
				"chastity"
			],
			"restraints": {
				"cuffs_arm": {
					"level": "front"
				},
				"cuffs_leg": {
					"level": "spreaderbar"
				},
				"gag": {
					"level": "severe"
				},
				"blindfold": {
					"level": "paneled"
				}
			},
			"embed": {
				"description": "!USER is intrigued in getting an invitation to the company after hours party. They heard that this party was private and very entertaining, so was very eager to attend. Also they hoped if they attend, this might help in their promotion.\nAfter the work shift was done, they only had 30 minutes to get to the party. No time to chance cloths, but enough time for a bathroom break and splash of water on their face. !USER asked the guard where the room was. Not wanting to be late, they did not future asked or wondered why it was in the basement level, quickly entering the elevator and going down 1 floor. Not wanting to be late, they were running down the basement hallway, going deeper into more darker corridors but that did not stopped him/her. Once they arrived they opened the door, everything was dark. Hmm, maybe they were too early. So they entered and tried to search for a ligthswitch, but quickly were incapacitated, drugged and lost consciousness.\nOnce !USER regain their consciousness, the first thing they saw was blankness, feeling something covering their eyes. They tried to reach it with their paws but found it unable to do so as they were tied. !USER tired to ask what's happening but their speech was muffled with the gag in their jaw. They tried struggling and found not only their legs was tied too but they were hanging upside down and worst of all, they were naked.\nHe/she could hear footsteps around themselves but was unable to see who made them, but from the noise it sounded more than just 1 person. It did not took too longtime for !USER to understand what kind of private party it was.\nBefore the fun started, they promised they getting extra payment this month and other gifts. Its going to be a long after hours party.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922458376758259712/ddnsd8j-3779b325-39a9-4cdd-b452-a366f774d0ad.png",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"after_company_part2": {
			"name": "After company hours party",
			"presents": [
				"whip"
			],
			"embed": {
				"description": "!USER is intrigued in getting an invitation to the company after hours party. They heard that this party was private and very entertaining, so was very eager to attend. Also they hoped if they attend, this might help in their promotion.\nAfter the work shift was done, they only had 30 minutes to get to the party. No time to chance cloths, but enough time for a bathroom break and splash of water on their face. !USER asked the guard where the room was. Not wanting to be late, they did not future asked or wondered why it was in the basement level, quickly entering the elevator and going down 1 floor. Not wanting to be late, they were running down the basement hallway, going deeper into more darker corridors but that did not stopped him/her. Once they arrived they opened the door and was surprised on what they saw. In the middle of the room there was a naked fox, all tied up and upside down. Besides being helplessly restrained, they were also gagged and blindfolded, adding more insult to their helpless state. !USER's boss invited them in and explained the party rules, that a submissive employer monthly will be used to release stress. The tied up employee is payed extra for getting themselves tied up, whipped, teased and sexually used the entire weekend.",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922458376758259712/ddnsd8j-3779b325-39a9-4cdd-b452-a366f774d0ad.png",
				"color": [
					205,
					92,
					92
				]
			}
		},
		"straitjacket": {
			"name": "Careful what you wish for",
			"presents": [
				"straitjacket"
			],
			"restraints": {
				"cuffs_leg": {
					"level": "taut"
				},
				"gag": {
					"level": "severe"
				},
				"sj": {
					"wear": "true",
					"arm": "front",
					"crotch": "double"
				}
			},
			"embed": {
				"description": "!USER was filling out a form that they found somewhere online. It looked realistic and that's why they liked it as it made it more realistic their dark fantasy. They place their ID picture and other personal information they felt comfortable sharing, as they wanted it to look realistic and present submit. !USER was happy with the end result, they liked it just how realistic it looked, making them excited. As they were preparing to go to the bed, they saw a shooting star and wish up to experience just a bit their dream, but they did not hooped too much about it.\nThe next morning while walking down the street they feel like they being watched. This makes them nervous and start running. Suddenly a cop car siren is heard and a cop holding a tasser pointing at !USER, ordering them to get down on the ground. !USER not wanting to get hurts does so and once on the ground another cop cuffs their paw behind their back before taking them back to the station.!USER finds themselves tied to an odd chair, still cuffed, this must be a mistake but they explained nothing yet. While they wait, they think about what the cause might be and prepare a statement in case they trying to charge them. However that's not whats happening\nWhen the officers enter the room, two guys dressed in white enters too. One of the person dressed in white checks the tablet and nods to the other telling to the cops 'We will take them'. !USER of course is confused on what they talking about. Before they got any chance to ask, they feel a small pain in their left side of their neck, observing the other white guy injected them with something. It doesn't take too long and they feel themselves getting sleepy, as everything around them slowly gets darks, he/she observers an employer tag on one of them that reads something, Vilnius something hospital. They can't make out the middle word before they loose consciousness.\n!USER slowly opens their eyes as a strong odor forces them to wake up. The first thing they see is a desk with a woman sitting on a chair. Seeing a stranger in a strange place, they quickly jump up but they are holder back by something. !USER quickly inspects why they can't move and the first sigh shocks them. Chair straps holding their straitjacketed body. !USER panics seeing this causing them to struggle in their bindings to which the women yells at them.\nAfter the initial yelling, the women presents herself calmly and asks questions. !USER is till confused but answers to some of the questions but also demands response on where and what is happening. Of course they get the response 'You are at the Vilnius Psychiatric Hospital were you are going to be hospitalized...Your profile shows you're high risk patient with the following issues....and involved in the following situation....with recommended stay 25 years to life...'. \n!USER observers this is the details that they submitted to the form. Quickly tries to explain that they submitted a form, that this is a mistake. The doctor corrects them that its impossible, the  form is only accessible via local network, can't be accessed from outside. But that explanation does not stop !USER still trying to explain its a mistake to the point the doctor forces a muzzle around their jaw and orders orderlies to take the new patient to the high risk ward.\n!USER squirms, this is not want they what they wanted. Before being dragged to their cell, the doctor promises that if they behave till chrismas, they going to get a gift",
				"image": "https://cdn.discordapp.com/attachments/797045849271566348/922458876538945546/ych_strait_red2.png",
				"color": [
					205,
					92,
					92
				]
			}
		}
	},
	"presents": {
		"dildo": {
			"name": "Dildo",
			"hp": 10,
			"embed_hidden": {
				"description": "You don't know what you got but a hint was provided. The hint is :'Its something long and hard.'"
			},
			"embed_show": {
				"description": "A large pink toy used for playing with your back hole. Its hard and flexible enough to reach deep parts."
			},
			"embeds_use_self": [
				{
					"description": "!USER takes the dildo and lubs it up decently, before slowly pushing it between their ass cheeks. Its slippery surface should ensure an easy push in and sitting down with it in should help it go in deeper."
				}
			],
			"embeds_use_others": [
				{
					"description": "!USER takes the dildo and lubs it up decently, before slowly pushing it between their !TARGET's ass cheeks. Its slippery surface should ensure an easy push in and sitting down with it in should help it go in deeper. !TAGET, you should enjoy yourself while !USER gives you pleasue."
				}
			]
		},
		"puffy_cuffs": {
			"name": "Puffy cuffs",
			"hp": 100,
			"embed_hidden": {
				"description": "You don't know what you got but a hint was provided. The hint is :'Its something puffy and you already experienced it.'"
			},
			"embed_show": {
				"description": "Puffy cuffs for pleasurable nights. The key's are next to the nightstand."
			},
			"embeds_use_self": [
				{
					"description": "Naked, !USER puts on some puffy cuffs before jumping in the. Once they get comfortable they lock the cuffs around the bed and their arms, pinning the4mselves to the bed, unable to move their arms to cover up or to the key placed down on the nightstand."
				}
			],
			"embeds_use_others": [
				{
					"description": "!USER cuffs !TARGET's paws and secures it to the bed. Now !TARGET is unable to cover themselves up as !USER has full access to their helpless body. Wonder what stuff will happen? Its going to be a long night for !TARGET."
				}
			]
		},
		"leg_warmers": {
			"name": "Leg warmers",
			"hp": 100,
			"embed_hidden": {
				"description": "You don't know what you got but but a hint was provided. The hint is :'Its something warm and comfortable on cold days at home.'"
			},
			"embed_show": {
				"description": "Cute and long warm socks. This will help making you look more feminine. Perfect for cheerleaders and femboys."
			},
			"embeds_use_self": [
				{
					"description": "!USER puts on a nice warm legwarmer. They will keep both of their legs warm during this cold winter. Not only they will keep them warm, but they also look nice to wear."
				}
			],
			"embeds_use_others": [
				{
					"description": "!USER forces legwarmer onto !TARGET's leg. They will keep both of their legs warm during this cold winter. Not only they will keep them warm, but they also look nice to wear. But maybe for !TARGET's its humiliating to wear suck socks. Well, they could have forced you to wear a dress and skirt too."
				}
			]
		},
		"leather_cuffs": {
			"name": "leather_cuffs",
			"hp": 100,
			"embed_hidden": {
				"description": "You don't know what you got but but a hint was provided. The hint is :'Its something black and restrictive.'"
			},
			"embed_show": {
				"description": "These leather restraints are high-quality and very durable. Incorporated with locking buckle so the slave can't take them off without their owner's permission."
			},
			"embeds_use_self": [
				{
					"description": ""
				}
			],
			"embeds_use_others": [
				{
					"description": ""
				}
			]
		},
		"magic_wand": {
			"name": "Magic Wand",
			"hp": 100,
			"embed_hidden": {
				"description": "You don't know what you got but but a hint was provided. The hint is :'Its something vibrating.'"
			},
			"embed_show": {
				"title":"",
				"image":"",
				"description": "Bzzzz... With this wand, you will experience great pleasure between your legs. Nothing says its a great day than a magic wand.\nOr be used to tease naughty and caged subs."
			},
			"embeds_use_self": [
				{
					"description": ""
				}
			],
			"embeds_use_others": [
				{
					"description": ""
				}
			]
		},
		"leather_muzzle": {
			"name": "Leather Muzzle",
			"hp": 250,
			"embed_hidden": {
				"description": "You don't know what you got but but a hint was provided. The hint is :'Its something keeping naughty boys or girls silent.'"
			},
			"embed_show": {
				"description": "Keeping your pups silent when the3y whimper or beg too much. With the locking buckles it can be ensured that they wont be able to take it off even with their mitted paws."
			},
			"embeds_use_self": [
				{
					"description": ""
				}
			],
			"embeds_use_others": [
				{
					"description": ""
				}
			]
		},
		"ball_gag": {
			"name": "Ball gag",
			"hp": 100,
			"embed_hidden": {
				"description": "You don't know what you got but but a hint was provided. The hint is :'Its round and red.'"
			},
			"embed_show": {
				"description": "Say stop to 'No' with this red ball. It can securely fit around a person jaw by using the straps."
			},
			"embeds_use_self": [
				{
					"description": ""
				}
			],
			"embeds_use_others": [
				{
					"description": ""
				}
			]
		},
		"chastity": {
			"name": "Chastity",
			"hp": 250,
			"embed_hidden": {
				"description": "You don't know what you got but but a hint was provided. The hint is :'Its something locking bad toys.'"
			},
			"embed_show": {
				"description": "Toys need to learn that their objective is to server their owner. Nothing more reminds them that than a chastity. The metallic device will stay securely around the wearer and wont be easily removed without the key.\nKey is not included."
			},
			"embeds_use_self": [
				{
					"description": "!USER locks away their genitals.Its seams the only pleasure is by pleasuring others. They might even give away their key to somebody."
				}
			],
			"embeds_use_others": [
				{
					"description": "!TARGET's luck just run off (or maybe they lucky) as !USER locks away !TARGET's genitals.Its seams the only pleasure !TARGET is getting is pleasuring !USER. Don't worry, bet !USER hide the key in a safe place, right? Lets hope they did not forgot where the key is, right?"
				}
			]
		},
		"whip": {
			"name": "Whip",
			"hp": 20,
			"embed_hidden": {
				"description": "You don't know what you got but but a hint was provided. The hint is :'Its something to punish bad boys or girls.'"
			},
			"embed_show": {
				"description": "Used as a punishment tool to teach naughty boys and girls."
			},
			"embeds_use_self": [
				{
					"description": ""
				}
			],
			"embeds_use_others": [
				{
					"description": ""
				}
			]
		},
		"condom": {
			"name": "condom",
			"hp": 1,
			"embed_hidden": {
				"description": "You don't know what you got but but a hint was provided. The hint is :'Can only be used once.'"
			},
			"embed_show": {
				"description": "Ensure safe sex. No worries for getting your girl pregnant or getting pregnant. Say yes to safe sex.\nWarning: Not recommended to be pulled over somebodies head."
			},
			"embeds_use_self": [
				{
					"description": "!USER places a condom over their device(s). Too bad the condom is one use item only as they would need more than one for a long night."
				}
			],
			"embeds_use_others": [
				{
					"description": "!USER was too eager to have sex with !TARGET, so they force a condom over !USER's device(s). Too bad the condom is one use item only as they would need more than one for a long night."
				}
			]
		},
		"straitjacket": {
			"name": "Straitjacket",
			"hp": 250,
			"embed_hidden": {
				"description": "You don't know what you got but but a hint was provided. The hint is :'Something warm but tight.'"
			},
			"embed_show": {
				"description": "Special suit for troubled minds. The cozy suit will ensure the wearer will be warm while helpless to use their hands.\nIts advised for wearer to wear diapers if nobody is observing them for long periods."
			},
			"embeds_use_self": [
				{
					"description": "Wow, !USER is amazing. They managed to put on a straitjacket and secure all bindings while wearing it, all by themselves. Now lets hope they can also undo all the straps by themselves too. You can always ask your kinky friend to help you undo the straps, but they might do more just to help you out. If not, bet the local hospital or authorities can help with that."
				}
			],
			"embeds_use_others": [
				{
					"description": "!TARGET's is forced by !USER to wear a special clothing, a straitjacket, that forces !TARGET to hold their arm in self-hug position. Don't worry, !USER will undo those restraints once they done having fun. OR they will drop you down at the nearest aslyum."
				}
			]
		}
	}
}