[
{"type":"unopen","fa":"33832141","gift":"sj","text":"!User visited the local bar. They observed a party was taking place were two individual were almost naked, drunk but also restrained in their jackets. Everybody was welcomed to help out those two with more drinks and teasing. You decided to 'help' them out. After you finished having fun with the boys, the host of party decided to give you a gift."}
,{"type":"unopen","fa":"20833152","gift":"winterclothing","text":"One of !User's friend decided to help out !User to get used to the cold weather by placing them in a freezer. After hours of work breaking the ice, they finally manage it. As a reward, the captor gives them a gift while taking the key from them, still trapped."}
,{"type":"unopen","fa":"25679230","gift":"christmas","text":"!User gets a surprise invitation from a friend, inviting !User to have some fun with two cute boys currently for the season."}
,{"type":"unopen","fa":"30101391","gift":"alchohol","text":"!User receives a gift from the drunken host. The box seams wet, wet with alcohol from the drunken host."}
,{"type":"unopen","fa":"34247245","gift":"evil","text":"Even the bad guys know its time to lay down your guns on this time of the year when one of them grabs !User by the ass to disarm them as they hand over to them a gift all wrapped in latex."}
,{"type":"unopen","fa":"35853971","gift":"nightclub","text":"!User gets invited to a party to a well known adult nightclub. Of course nobody informed them, that they going to be become one of the clubs entertainment. For the hard work, the club owner is rewarding them with a gift all wrapped in latex package. To bad that !User is still trapped to receive the package."}
,{"type":"unopen","fa":"34417009","gifts":["sj","christmas","bdsm"],"count":3,"text":"!User gets invited to partake in christmas carolers. You receive 3 gifts all nicely wrapped"}
,{"type":"unopen","fa":"34209805","gift":"bdsm","text":"!User has a dream with krampus in it. Krampus informs that Santa wont give them a gift as they been naughty, however he also informs that its their job to give gifts to naughty one. Slapping !User ass, they awoke to find a gift in their bed. All wrapped in black rubbery fabric."}
,{"type":"unopen","fa":"4878051","gift":"winterclothing","text":"!User managed to get caught by naughty snowman. After they had fun with !User, they left him/her a gift, all wrapped in blue fabric, cold as ice."}
,{"type":"unopen","fa":"34618835","gift":"nightclub","text":"3 guys asked !User to help them out with something. Of course !User agreed to help them out. They give !User a nicely wrapped gift after their hard work!"}
,{"type":"unopen","fa":"34348429","gift":"bdsm","text":"!User had a nicer evening at the reindeer party. It was so great that they received even a gift from the host."}
,{"type":"unopen","fa":"35662815","gift":"christmas","text":"!User had a nicer evening at the reindeer party. It was so great that they received even a gift from the host."}
,{"type":"unopen","fa":"3175357","gift":"christmas","text":"!User is surprised a bit with the unannounced guest bellow their Christmas tree. Lucky for !User, this guests dose not want to hard them, instead gives them more than one gift."}
,{"type":"unopen","fa":"34852893","gift":"toys","text":"No Christmas is fun alone, but lucky !User friends going to keep them occupied. Even going to leave behind a gift after they left."}
,{"type":"unopen","fa":"9545598","gift":"toys","text":"No Christmas is fun alone, but lucky !User friend going to keep them occupied. Even going to leave behind a gift after they left."}
,{"type":"unopen","fa":"25839301","gift":"christmas","text":"!User is receiving gifts from their reindeer friend. Not only an early gift but also a box that they can open at much later date."}
,{"type":"unopen","fa":"34284846","gift":"bdsm","text":"!User gets captured by Krampus. Its seams they not the only one, as both of them are dragged to Krampus's home. Don't worry, he promised to release both of them and give them a gift, after he had fun with !User and the other guest."}
,{"type":"unopen","fa":"21869304","gift":"toys","text":"!User lifts up their ears to the sounds coming from the neighbouring room. Opening the door they surprised by the gifts under the tree. At least one of the gift is already opened and waiting to be used while the other still wrapped under the tree."}
,{"type":"unopen","fa":"18594991","gifts":["toys","toys","bdsm"],"text":"!User lifts up their ears to the sounds coming from the neighbouring room. Opening the door they surprised by the gifts under the tree. Already few of the gifts are opened and ready to be played with, regardless if !User wants to play with them. Lucky that some gifts still remain unopened."}
,{"type":"unopen","fa":"15365537","gift":"toys","text":"Hearing some bells sound from neighbouring room, !User decides to check it out. Entering the room, !User finds the present waiting for them eagerly. Beside her is a gift that she promised to give !User if they put their nose between her legs."}
,{"type":"unopen","fa":"25936524","gifts":["toys","bdsm"],"text":"!User had a long day, all they want is to go to bed. Opening their bedroom, they shocked to find a tied up gift eagerly waiting for them. It's not the only gift in the room, as there is also a box in the bed, all wrapped in green paper. But this one is at least opened enough to be used."}
,{"type":"unopen","fa":"18504845","gifts":["toys","bdsm","bdsm"],"text":"!User is invited to a party that they wont forget for some time. Nice music, lovely atmosphere and great entertainment. In fact, every participant to the party receives a gifts before leaving."}
,{"type":"unopen","fa":"29860345","gifts":["toys","toys","bdsm"],"text":"!User lifts up their ears to the sounds coming from the neighbouring room. Opening the door they surprised by the gifts under the tree. Already few of the gifts are opened and ready to be played with, regardless if !User wants to play with them. Lucky that some gifts still remain unopened."}
,{"type":"unopen","fa":"12417573","gifts":["toys","toys","nightclub"],"text":"This month is all about giving and receiving. !User decides to give for their deer friend and as such they receive 2 gifts. One of the gifts is opened and already in use."}
,{"type":"unopen","fa":"25743442","gifts":["toys","nightclub"],"text":"!User had a long day, all they want is a good nap at the fire place. Entering the room, !User is greeted by a present eagerly awaiting at the fire place with the end of the leash carefully placed on the chairs arm. Besides this cute present is also a gift, all wrapped up nicely like the other present !User got."}
,{"type":"unopen","ibunny":"537149","gift":"toys","text":"Arriving home, !User is greeted by a gift waiting them eagerly and already drunk. Besides the first opened is another box not yet opened."}
,{"type":"unopen","ibunny":"2053163","gifts":["toys","toys"],"text":"!User gets invitation to a party. They have a great party. After the party, everyone receives 2 gift boxes."}
,{"type":"unopen","ibunny":"536010","gift":"toys","text":"!User is greeted by a gift waiting them eagerly. Besides them is another box not yet opened."}
,{"type":"unopen","ibunny":"1770693","gifts":["toys","bdsm"],"text":"!User is greeted by a gift waiting them eagerly and all bound. Besides them is another box not yet opened."}
,{"type":"unopen","ibunny":"762518","gifts":["toys","bdsm"],"text":"An eagerly gift is waiting for !User to gently open and use them."}
,{"type":"unopen","ibunny":"759143","gifts":["toys","nightclub","bdsm"],"text":"!User gently pulls on their gift's present as they place down a box in front of !User before pulling them closely."}
,{"type":"unopen","ibunny":"770664","gifts":["toys","bdsm"],"text":"!User slaps the deer ass for only giving them 2 gifts instead of 4."}
,{"type":"unopen","ibunny":"1095901","gifts":["toys","bdsm"],"text":"!User is surprised of the gifts they receive. One of the gift already looks eager to be used."}
,{"type":"unopen","ibunny":"1507788","gifts":["toys","bdsm"],"text":"!User is welcomed with a gift waiting for them, all bound and looking at you."}
,{"type":"unopen","ibunny":"2030187","gifts":["toys","bdsm"],"text":"An eagerly gift is waiting for !User to gently open and use them."}
,{"type":"unopen","ibunny":"988745","gifts":["toys","bdsm"],"text":"Gifts are waiting for !User to open them and use them. Still bound and caged, they wont be going anway too soon."}
,{"type":"unopen","ibunny":"993431","gifts":["toys","bdsm"],"text":"!User is greeted by a nicely wrapped gift squirming. Lucky the gift is tightly wrapped up, no way accidentally opening. Besides them is another smaller gift."}
,{"type":"unopen","ibunny":"1779018","gifts":["toys","bdsm"],"text":"!User receives a big teddy bear with instruction on how to use and maintain it. Besides the big gift they also receive 2 smaller boxes."}
,{"type":"unopen","ibunny":"992959","gifts":["toys","bdsm"],"text":"!User is invited to a party. The host was so nice that after the party they give 2 gifts to !User."}
,{"type":"unopen","ibunny":"2051012","gift":"toys","text":"!User is surprised with the open gift waiting for them. They eagerly waiting to be used and to gift !User."}
,{"type":"unopen","ibunny":"2027817","gift":"toys","text":"!User is surprised with the open gift waiting for them. They eagerly waiting to be used and to gift !User."}
,{"type":"unopen","ibunny":"1915293","gift":"toys","text":"!User is surprised with the open gift waiting for them. They eagerly waiting to be used and to gift !User."}
,{"type":"unopen","ibunny":"2045532","gift":"christmas","text":"An eagerly gift is waiting for !User to gently use them. Besides them is another box all wrapped up nicely."}
,{"type":"unopen","ibunny":"1835489","gift":"toys","text":"!User is invited to a party at the local bar. The hosts gives a present once !User needs to leave."}
,{"type":"unopen","ibunny":"46300","gifts":["toys","bdsm"],"text":"!User is greeted by a nicely wrapped gift squirming. Lucky the gift is tightly wrapped up, no way accidentally opening. Besides them is another smaller gift."}
,{"type":"unopen","ibunny":"558162","gifts":["toys","bdsm"],"text":"!User is greeted by a nicely wrapped gift. Lucky the gift is tightly wrapped up and blindfolded, easily open for anyone to use them. Besides them is another smaller gift."}
,{"type":"unopen","ibunny":"1503608","gift":"nightclub","text":"!User is welcomed by a guest waiting for them to get undressed as they present their body for them."}
,{"type":"unopen","ibunny":"1709387","gift":"nightclub","text":"!User is welcomed by a guest waiting for them to get undressed as they present their body for them."}
,{"type":"unopen","ibunny":"2020118","gift":"nightclub","text":"!User is welcomed by a gift all nicely wrapped up waiting for them. They eagerly showing off the present between their legs, ready to be used. Besides them is a small box."}
,{"type":"unopen","ibunny":"549168","gift":"nightclub","text":"!User is welcomed by a guest waiting for them to watch at them as they slowly dance around the pole."}
]