[
{"toy":"foxTrap","type":"clothing","e621":"2531952","name":"Trap","desc":"Nice and kinky clothing wearing out for the nightclub.","text":"!User opens the box and finds some clothing to wear for a nightclub.\nThey decide it to wear it and go out to have some fun."}
,{"toy":"maid","type":"clothing","e621":"2531588","name":"Maid Uniform","desc":"Standard uniform for the nightclub maids. Softly presenting their bodies to visitors as they clean up the messes from the floor and tables. Additionally performing other duties if paid by a client.","text":"!User opens the box and finds some maid uniform to wear for a nightclub with a note on it.\nThe note reads \"Come to our yiff bar all dressed up if you want to work here."}
,{"toy":"reindeer","type":"clothing","e621":"2531570","name":"Reindeer Uniform","desc":"Festive uniform for the nightclub 'toys'. Collared & ready to be leashed by any paying clients.","restraints":[{"name":"collar","level":"leather"},{"name":"mitts","level":"pony"}],"text":"!User opens the box and finds some reindeer uniform to wear for a nightclub, with fake antlers, gloves that act as mitts, collar and a harness with bells. They also find a note.\nThe note reads \"Come to our yiff bar all dressed up if you want to work here."}
,{"toy":"vippass","type":"pass","e621":"2441929","name":"VIP Pass","desc":"A VIP pass for the local yiff nightclub.","text":"!User opens the box and finds an plastic card. Carefully looking they observer its a VIP pass for the local yiff bar. A pass to one of the stripes."}
,{"toy":"nightclubwear","type":"clothing","e621":"2363085","name":"Nightclub Uniform","desc":"Standard nightclub clothing to get yiffed by the DJ.","text":"!User opens the box and finds a set of fishnets, striped armwear, legwear and a jockstrap.\nA note is attached to the jockstrap that reads \"Come to the yiff bar to have some fun."}
,{"toy":"dildo","type":"toy","fa":"29588504","name":"Dildo","desc":"A dildo for sexual penetration and stretching that back end for something else.","text":"!User opens the box and finds a small dildo and a note attached to it. The note says \"Come to the nightclub with it and show us just how a good 'girl' you are by playing with it.\""}
,{"toy":"halloweencostumebdsm","type":"costume","e621":"2444187","name":"Costume","desc":"An costume desgined to enforce the wearer to be helpless and controled by the leash holder.","restraints":[{"name":"arm","level":"behind"},{"name":"gag","level":"severe"}],"text":"!User opens the box and finds a costume with belts, straps, locks, gag and a collar. The letter simple says \"Come to the yiff club. Better be dressed when you arrive.\""}

]