[
{"toy":"sjcursed","type":"clothing","e621":"2456702","name":"Cursed Jacket","desc":"Cursed straitjacket that bounds to the first person touching it.","restraints":[{"name":"sj","arm":true,"leg":true},{"name":"gag","level":"extreme"}],"text":"!User opens the box and finds a straitjacket waiting for them to put on.\nThe moment they touch it, it comes to life and restrain !User quickly without giving them a fair chance to fight."}
,{"toy":"sjjingle","type":"clothing","fa":"29641603","name":"Jigle Jacket","desc":"A festive straitjacket ready to show their spirit to give and to receive.","restraints":[{"name":"sj","arm":true,"leg":true}],"text":"!User opens the box and finds a straitjacket, not just any straitjacket but a festive one.\nIn the spirit of the holidays, they decide to wear them the entire night."}
,{"toy":"sjinmate","type":"clothing","e621":"2429788","name":"Inmate Jacket","desc":"A straitjacket for the crazy inmates at maximum security prison.","restraints":[{"name":"sj","arm":true,"leg":true},{"name":"gag","level":"extreme"},{"name":"leg","level":"sit"}],"text":"!User opens the box and finds a rubber straitjacket waiting for them to put on. They find the colour odd, orange instead of white.\nThat does not stop them on putting it on. !User decides to go out to the kink bar wearing that, to be used.\nUnknown to them, the jacket they wearing is an inmate jacket for the crazy inmates at a maximum security prison. Its going to be hard to prove their innocence while wearing that."}
,{"toy":"sjQuietTime","type":"clothing","e621":"2448928","name":"Black&Purple Jacket","desc":"A straitjacket to ensure misbehaving pets remains quiet and thinks about what they did.","restraints":[{"name":"sj","arm":true,"leg":true},{"name":"gag","level":"extreme"},{"name":"leg","level":"sit"},{"name":"blindfold","level":"paneled"},{"name":"ear","level":"muffs"}],"text":"!User opens the box and finds a latex straitjacket waiting for them to put on.\nThey put it on and go out to a kink bar to have fun.\nDo to their constant annoyance, the manager of the bar decides that !User needs some quiet time, luckily they wearing their main gear, just need to add extra stuffs."}
,{"toy":"sjcursed","type":"clothing","fa":"39710778","name":"Cursed Jacket","desc":"Cursed straitjacket that bounds to the first person touching it.","restraints":[{"name":"sj","arm":true,"leg":true},{"name":"gag","level":"extreme"}],"text":"!User opens the box and finds a straitjacket waiting for them to put on. The moment they touch it, it comes to life and restrain !User quickly without giving them a fair chance to fight."}
]