[
{"toy":"dildo","type":"toy","fa":"29588504","name":"Dildo","desc":"A dildo for sexual penetration and stretching that back end for something else.","text":"!User opens the box and finds a small dildo and a note attached to it. The note says \"Use that toy to prepare yourself. As i will be coming on new year eve.\""}
,{"toy":"dildoRainbow","type":"toy","e621":"2382466","name":"Rainbow Dildo","desc":"A dildo for sexual penetration and stretching that back end for something else. Rainbow colour style.","text":"!User opens the box and finds a rainbow dildo and a note attached to it. The note says \"Use that toy to prepare yourself. As i will be coming on new year eve.\""}
,{"toy":"dildoVibrator","type":"toy","e621":"2274691","name":"Anal Vibrator","desc":"An anal toy that's not just used for sexual penetration, but also vibrates. Vibrating till the batteries run out.","text":"!User opens the box and finds a anal vibrator and a note attached to it. The note says \"Have fun and jiggle your butt.\""}
,{"toy":"dildoEquine","type":"toy","e621":"2354539","name":"Equine Dildo","desc":"A much bigger version from the classic dildo . Stretching out the ass hole much more, preparing the wearer for a very big dick.","text":"!User opens the box and finds a equine dildo, so big that they need a metal bar to able to ride it."}
,{"toy":"controllerVibrator","type":"toy","e621":"2285463","name":"Controller","desc":"A vibrating game controller, used for playing videogames and possible other stuffs.","text":"!User opens the box and finds a game controller used for videogames."}
,{"toy":"dildoSquirting","type":"toy","e621":"2388525","name":"Squirting Dildo","desc":"A dildo with a hole in the middle to squirt any liquids up ones ass or their jaw.","text":"!User opens the box and finds a dildo with a clear plastic tube connected to it and a hole in the middle. This going to be a pleasurable night."}
,{"toy":"remoteVibrator","type":"toy","e621":"2445303","name":"Remote Vibrator","desc":"An anal toy that's not just used for sexual penetration, but also vibrates. Included with a remote to control the intensity.\nVibrating till the batteries run out.","text":"!User opens the box and finds a anal vibrator with a remote controlled. This going to be a pleasurable night."}
,{"toy":"poolsuit","type":"suit","e621":"2389100","name":"Pool suit","desc":"An latex goo that transforms its victim into rubbery pool toy.\nNote: The wearer can't remove the suit by themselves.","restraints":[{"name":"mitts","level":"puppy"},{"name":"gag","level":"extreme"}],"text":"!User opens the box and finds a bottle with blue liquid in it. Opens it to smell it and smell odd.\nAs the pour a bit on their paws, it starts spreading, quickly.\nBefore they can ask for help, the substance covers them from head to toe in a rubbery skin, transforming them into a pool toy."}
,{"toy":"halloweencostumebdsm","type":"costume","e621":"2444187","name":"Costume","desc":"An costume desgined to enforce the wearer to be helpless and controled by the leash holder.","restraints":[{"name":"arm","level":"behind"},{"name":"gag","level":"severe"}],"text":"!User opens the box and finds a costume with belts, straps, locks, gag and a collar. The letter simple says \"Come to the yiff club. Better be dressed when you arrive.\""}
,{"toy":"reindeersuit","type":"suit","fa":"9551062","name":"Reindeer suit","desc":"An squeaky rubbery goo that transforms its victim into rubbery reindeer toy.\nNote: The wearer can't remove the suit by themselves.","restraints":[{"name":"mitts","level":"pony"},{"name":"gag","level":"extreme"}],"text":"!User opens the box and finds collar with a jiggle bell on it.\nThe moment they put it on, a rubbery liquid starts covering up their entire body, transforming them into reindeer toys, helpless and ready to help anyone dressed up as Santa."}

]