[
{"e621":"2425898","text":"@User ended up becoming a gift, a puppy toy. Their gear ensures they will be have like any good puppy toy should."}
,{"e621":"2425807","text":"Putting on a Nullsuit is not that hard. And while you can run its setup to configure the suit the way you want it, you can leave it on default settings. @User choice to ignore the manual warnings and put on the suit with the default settings. Little did they know putting on is the easy part, taking it off is the hard part."}
,{"e621":"2400605","text":"@User is begging for treats like a proper dog. Or maybe they begging for release?"}
,{"e621":"2429784","text":"@User could not take Locktober any-more and agreed to anything."}
,{"e621":"2429782","text":"@User agreed to be a photo model for a new magazine. Little did they know what magazine it was and what they agreed on."}
,{"e621":"2427017","text":"@User is attempting to remember how it felt to be free and not denied."}
,{"e621":"2426924","text":"Being denied does not mean you can't have sex, as @User is learning that lesson as nothing more than a fuck toy."}
,{"e621":"2426196","text":"Misbehaving patients get punished and @User misbehaved. This punishment should keep them calm and teach them a lesson."}
,{"e621":"2419843","text":"Its important to properly train @User."}
,{"e621":"2419571","text":"@User was given a challenge. They can use the key to free themselves. Its a fair challenge."}
,{"e621":"2404120","text":"Princess @User is showing off their goods like a good princess should."}
,{"e621":"2401617","text":"It can be hard work working at a club, especially if denied your own pleasure, but @User is doing a fine work."}
,{"e621":"2400621","text":"@User is slowly learning on how to receive pleasure from anal only."}
,{"e621":"2393968","text":"Committing a crime, you get punished for it. @User is learning the hard way some of this punishments. Don't worry, its a community service, they will be released after servicing 1000 clients."}
,{"e621":"2392695","text":"@User got transferred from their padded cell to a new room to perform some experimentation."}
,{"e621":"2391971","text":"@User decided to do a new theme of trick&treat."}
,{"e621":"2388347","text":"If @User dislikes or wants to stop their teasing, they should say their safe word. After all moaning means more."}
,{"e621":"2386003","text":"Nigh times can be hard as @User is once again experiencing one of those nights."}
,{"e621":"2367203","text":"No cage can stop @User from experiencing pleasure, just need a little help from one or more persons."}
,{"e621":"2365179","text":"Inmate @User is having their monthly milking, this been regular for them for 3 months. The prison can't be bothered cleaning after them. They should be free after 2-5 years."}
,{"e621":"2365186","text":"@User got a simple task. Find the key before the timer runs out. Its simple, its not like its unfair with the mitts, gag and a constant toy edging them or the fact there is 100 of keys."}
,{"e621":"2366569","text":"@User agreed to help out the workers. By the looks of it, they prefer this job over an office job."}
,{"e621":"2350902","text":"Bad subs like @User needs a reminder what happens if they bad."}
,{"e621":"2350935","text":"@User is showing off their ass."}
,{"e621":"2351504","text":"@User is being a nice rubbery pup in the bed."}
,{"e621":"2344549","text":"Dildos are your best friend as @User learns that."}
,{"e621":"2335110","text":"@User agreed to volunteer for a charity fund raiser, however they skipped the part of reading what they agreed to and how long and jump signing it."}
,{"e621":"2333694","text":"@User is a good boy, showing their cage when asked."}
,{"e621":"2331243","text":"@User is trying out their new suit and streaming it online to get some cash from wearing it. It seams the chat is very interested in prolonging @User denial and teasing. Hope they set a max or its going to be a long session."}
,{"e621":"2322988","text":"The streaming software has bugged out and is accidentally streaming @User as they try to take care of their denied release."}
,{"e621":"2311930","text":"@User agreed to help out the community. It seams the community had no issue accepting their help."}
,{"e621":"2301897","text":"@User is learning that their own pleasure is irrelevant, that they need to focus on the pleasure who ever is holding the leash."}
,{"e621":"2298214","text":"Monthly milking for @User. Look at how much they enjoying it."}
,{"e621":"2298212","text":"Monthly milking for @User. Look at how much they enjoying it."}
,{"e621":"2289187","text":"Monthly milking for @User. Look at how much they enjoying it. Bet they would beg move if it was not for the muzzle."}
,{"e621":"2276460","text":"@User agreed to become a permanent statue. Little did they know this might be their last release and their owner wont make it easy for them."}
,{"e621":"2268833","text":"@User is learning what happens to frisky patients who try to hump anything."}
,{"e621":"2257151","text":"@User might be regretting their choice when they said yes to the stranger at the bar. But its too late, no way to back out."}
,{"e621":"2253603","text":"@User is learning what's worst of being sex slave. The constant pent up state, were your own sexual needs and release are ignored."}
,{"e621":"2427011","text":"They say you can earn quick cash by volunteering for medical testing, that's why @User quickly signed up for medical testing. They never say you will end up bound, muzzled, sexually denied, teased and used in some crazy experiment. The worst is you agreed to long term testing and you know just how long that long term testing is."}
,{"e621":"2429166","text":"@User has found themselves in a sticky situation. When their master told them that they are going to mark them as their property @User thought that they would only need to wear their cage, but they soon found out what it actually means to be owned."}
,{"e621":"2435747","text":"What is a better way to bond than a bit of a rough play? @User is enjoying some afterglow musk after a long session of screaming their cute ass. "}
,{"e621":"2366571","text":"This hot bun will soon get to enjoy his other hole when he gets to taste the results of his hard labour."}
,{"e621":"2369450","text":"Straining against the bonds of his soft prison @User gets to enjoy some love while their strain against something else other than their restraints."}
,{"e621":"2361060","text":"Threesomees are fun. Even if you're not allowed to cum. But for @User that's the joy of being a cum dump."}
,{"e621":"2365175","text":"@User didn't think that getting to cum could be a punishment, but as the machine drained them of all their pent up spunk @User could do nothing else but enjoy their partner's jizz."}
,{"e621":"1869039","text":"@User is seeking pleasure and they know how to receive it."}
,{"e621":"1895841","text":"Self-bondage can be fun but its best practive to ensure you can free yourself. @User is learning the hard and long way what happens if you are too eager to pleasure yourself and dont think about the risks."}
,{"e621":"1948019","text":"Hearing that the KinkOctober carnival is here, @User decided to volunteeer for one of the entertainments. Bound&caged they got exposed to the public who are eagerly waiting to press the button the moment they see a precum drop. Its going to be a long week for our volunteer."}
,{"e621":"1995935","text":"@User has one of the hardest job as pet for entertainment. All bound, gagged and tailhole used by many clients, especially when they don't get any release from getting used. They even marked @User's face as to remind the pet who gets release and who does not."}
,{"e621":"2121644","text":"@User is learning an important lessons what happens if they touch something they should not touch, even if that something is part of their body."}
,{"e621":"2127590","text":"@User agreed for few bucks to get all tied up and caged. "}
,{"e621":"2140840","text":"@User is learning an important lessons how chastity slaves like them get to cum. Jaw used, butt streched by a big dildo, wand on the private parts and their private parts caged in a cold steel prison."}
,{"e621":"1979887","text":"@User's luck just ran out as they grabbed by a predator, teaching them were preys belong."}
,{"e621":"1995954","text":"@User after the mech opened their big mought complaining that there are no dom in the team. Well, it seams a dom was there and heard the complaint and is now punishing @User for the complaints. Tying them down, caging them up, gagging them and using them before sharing with the rest of the team."}
,{"e621":"2002823","text":"It seams that @User has lost a bet and now is a public fuck toy at a public park. To ensure its a punihsment, the winner caged their dick away."}
,{"e621":"2127754","text":"Penetrating toys are the best friends for caged furs like @User. Just look how much they eagerly leaking."}
,{"e621":"2136005","text":"Getting hard while caged sucks and @User is observing that right now."}
,{"e621":"1694644","text":"@User is going to show the rest of the guests just how much they can be entertaining. So let the party start."}
,{"e621":"1717242","text":"@User was a good pup, they managed to do 60 days without orgasm. Ohh, do you think you get a release? No, lets keep it up and see if you can do a year."}
,{"e621":"1743234","text":"@User agreed to roleplay as patient with their roomate. As a part of roleplay, @User agreed to be put in a straitjacket and muzzled, but as more roleplay grogressed more, @User was questioning where it was heading."}
,{"e621":"2077687","text":"@User had a crazy idea for halloween, to wear an auhentic straitjacket. @User's friends had no issue helpoing by restraining their friend , but once helpless, they did more than it was planned. It looks like @User will get alot of attention when going for tick or treat, lets hope the treats are nice."}
,{"e621":"2111306","text":"Just because @User lost the privilage to fuck asses does not mean they can't clean asses."}
,{"e621":"1944844","text":"Penetrating toys are the best friends for caged furs like @User. Just look how much they lke it."}
,{"e621":"2427017","text":"@User is desperate to feel the pleasure of humping, so they attached a fake dick to their caged dick and started to hump a fleshlight."}
,{"e621":"2085772","text":"It seams @User was too exited to try out their new toy to observer their roomat was filming them."}
,{"e621":"1996179","text":"@User is a good pup. Proudly presenting themselves and wearing their gears and enjoyingevery moment of helplessness."}
,{"e621":"2113116","text":"Slave @User needs to learn that slaves suffering and pleasure are secondary to their owners pleasure."}
,{"e621":"2132181","text":"It seams @User managed to cause an accident while cleaning the floor. Their owner sure going to be upset about the mess."}
,{"e621":"2143373","text":"@User thought it would be a simple job to apply as maid to a mansion owner. Well it turns out the job has very extreme requirement for @User. Don't worry, its just a 2 years job poisition. "}
,{"e621":"1974828","text":"@User was denied for too long as they eagerly lift up their ass, exposing their hole for any taker."}
,{"e621":"1651622","text":"Registering to any college you see on the internet is not recomended as @User is experiencing what college they assigned to. They will need to complete 4 years of study for graduation befoe a custom permanent chastity is locked around their bitts."}
,{"e621":"1670364","text":"Slave @User is learning the lessosn that their master can use them without needed access to their holes."}
,{"e621":"1825437","text":"@User eagerly waites for you to fuck them, locking their own dick away so only you can pleasure them. They even leashed themselves to the bed and toyed with their hole."}
,{"e621":"1598881","text":"@User heard that a new shop was searching volunteeers to test out the new chair for fast learning. Wanting to make quick bucks, they volunteerd. By the time the chair stops, they wont be the same person who entered. In fact they will be the new toy for others to rent or buy."}
,{"e621":"2075311","text":"@User found a quick and easy way earning pizza and by the looks of it, its profitable."}
,{"e621":"1827735","text":"Patient @User was declared to be too deviant for their own good. Besides getting 24/7 straitjacketed, they also getting the cage to prevent future misbehaviors."}
,{"e621":"1851302","text":"@User is a good slave. They just need to follwo their owners request even if that involves deniying your own pleasure and freedom."}
,{"e621":"2411018","text":"No matter how much @User pulled the mask wouldn't come off. They could do nothing but huff the pheromones which made their cage seem smaller than it is."}
,{"e621":"2367203","text":"@User is being a good little boy-toy by making sure no cock gets left unsucked. Who knows? Maybe once he's done with his anal training some other cutie will get to practice on him."}
,{"e621":"2436098","text":"Being caught slacking off would be strictly punished. @User didn't think it would be this strict."}
,{"e621":"2435759","text":"You'll get used to it, she assured them. And @User better will, as the two month period of their lockdown is just starting."}
,{"e621":"2435886","text":"When @User took the internship they thought that they would just go around making coffee. To their surprise it would entail a little bit of unconditional learning. Too bad their coworkers like to switch the remote for the projector with the one for @User 's vibe."}
]