[
{"e621":"2419049","text":"@User is ready to drag the cart."}
,{"e621":"2396964","text":"@User might be annoyed of their suit, but that's what ponies wear."}
,{"e621":"2359919","text":"@User agreed on working their debts on the field. Little did they know what work they agreed too."}
,{"e621":"2347863","text":"@User is showing off just how excited they are for being a good pony."}
,{"e621":"2293459","text":"@User wakes up blind, hot and paws useless as they try to take off what ever is covering their head, but with those gloves they wont succeed. Little they know that the people who kidnapped them are preparing the farm land."}
,{"e621":"2263249","text":"@User is ready to drag the cart or work the fields."}
,{"e621":"2253533","text":"@User is presenting their gear for inspection. A good pony is a geared pony."}
,{"e621":"2253716","text":"@User is presenting their gear for inspection. A good pony is a geared pony."}
,{"e621":"2251289","text":"@user is learned on how to be a pony."}
,{"e621":"2144747","text":"@User is presenting their gear for inspection. A good pony is a geared pony."}
,{"e621":"2143385","text":"@User should have read the warning labels on the package before putting on the outfit. Now the living latex will finish the ponyification regardless of the wearer choice."}
,{"e621":"2106470","text":"@User is ready for the public, showing off just how a good show pony they are."}
,{"e621":"2050085","text":"@User is learning the hard way how its to carry somebody on their back, but that's what ponies do."}
,{"e621":"1835191","text":"@User is ready for their daily walks on the fields."}
,{"e621":"1820461","text":"A good pony should always agree to their handler, like @User, who is a good pony."}
,{"e621":"1746870","text":"@User is ready to take passengers on their back. What a good pony they."}
,{"e621":"1719908","text":"@User might be embarrassed of their situation, but this little pony sure looks exited of their condition."}
,{"e621":"1686635","text":"@User sure looks nice and ready as their binders are pulled."}
,{"e621":"1641859","text":"@User is ready for a handler to take their leash to the binders, ready to be pulled like the pony they are."}
,{"e621":"1637801","text":"@User is experiencing how ponies might have felt as they were ridden during the war, and they might be regretting it as their handler says \"ONWARD, TO GLORY!\"."}
,{"e621":"1638728","text":"@User wonders who their new owner is after they been sold."}
,{"e621":"1513532","text":"@User looks happy as they ended up on the front cover of PLAYPONY. Dont let the looks fool you, they are excited of it."}
,{"e621":"1443155","text":"@User is offering themselves as gift on valentines day."}
,{"e621":"1425938","text":"@User might not like the gears and might argue about it, but the gears are there to restrict their misbehaviour like all bad ponies should be."}
,{"e621":"1389635","text":"@User is learning that their handler can ride them and have fun at the same time."}
,{"e621":"1265976","text":"@User was a bad pony, so time out for them."}
,{"e621":"1213446","text":"@User is in training, they are learning how to be good pony."}
,{"e621":"1211871","text":"@User after the harsh training is sent off to the auction block. They will earn good money to auction house."}
,{"e621":"1211857","text":"@User is in training, they are learning how to be good pony."}
,{"e621":"1015091","text":"@User is a working pony, as such they working on the farm doing farm tasks."}
,{"e621":"973431","text":"@User is getting ready for their extra duties, a side task to their daily farm duties."}
,{"e621":"962884","text":"@User is getting treats from their handler for being a good pony."}
,{"e621":"902364","text":"This pony, @User, misbehaved. They got excited so they need to cool down."}
,{"e621":"2427147","text":"@User is being taken to a nice relaxing walks in the woods."}
,{"e621":"2416471","text":"@User is work pony, they working hard on plowing the fields."}
]