[
{"e621":"2427011","text":"They say you can earn quick cash by volunteering for medical testing, that's why @User quickly signed up for medical testing. They never say you will end up bound, muzzled, sexually denied, teased and used in some crazy experiment. The worst is you agreed to long term testing and you know just how long that long term testing is."}
,{"e621":"2429788","text":"@User attempted to steal one of the guards ID card. As punishment they been re-assigned to high-security unit."}
,{"e621":"2428551","text":"@User is learning that you don't need hands to able to please others dicks."}
,{"e621":"2426188","text":"@User agreed to a challenge involving straitjacket and edging. It seams they wont the challenge, but no were it was mentioned they be set free after winning it."}
,{"e621":"2425776","text":"@User is too pent up for a straitjacket to stop them for humping the pillow."}
,{"e621":"2392695","text":"@User got transferred from their padded cell to a new room to perform some experimentation."}
,{"e621":"2388347","text":"If @User dislikes or wants to stop their teasing, they should say their safe word. After all moaning means more."}
,{"e621":"2365179","text":"Inmate @User is having their monthly milking, this been regular for them for 3 months. The prison can't be bothered cleaning after them. They should be free after 2-5 years."}
,{"e621":"2358069","text":"Patients who make to much noise, like @User will get muzzled. The feeding tube wil ensure they can get feed while muzzled as well."}
,{"e621":"2325727","text":"@User agreed for a medical routine check-up, but soon found themselves tied down on a bed, wearing a straitjacket and muzzled. All they can do is watch the sketchy doctor restraining them even more."}
,{"e621":"2274309","text":"@User agreed to be used as a toy during sex, but never agreed to be keep still restrained even after the sex."}
,{"e621":"2269355","text":"@User was a bad patient, they keep trying to hump the bed so the nurses decided to do something about it. Have a pleasant dream, @User."}
,{"e621":"2268833","text":"@User is learning what happens to frisky patients who try to hump anything."}
,{"e621":"2259362","text":"@User applied for a job at a local sauna place. Too bad they did not read what this job was. Don't worry, on Monday next week is your day off."}
,{"e621":"2216342","text":"@User got labelled as crazy dangerous patient. As such some precaution needed to be applied to ensure their and ours safety. Don't worry, if they try to do something funny, a shock collar will be locked around their neck."}
,{"e621":"2128308","text":"@User was labelled to dangerous to be on their own, so a nurse tied them up in a straitjacket and muzzled them. Don't worry, the nurse will keep a good eye on them."}
,{"e621":"2105889","text":"@User is starting to regret the fates that lead them on this path. Straitjacketed, gagged and used in some crazy experiments is not what they had in mind."}
,{"e621":"2077686","text":"For Halloween @User is trying out a new costume. Its hard to get in, but with friends its not that hard. The only issue is, it seams their friends are also pranksters, pulling down their shorts once they helpless."}
,{"e621":"2054060","text":"This is not what @User signed up as they slowly being tied down to a bed and hood placed over their head. Yes, they did sign up for a medical check-up, not to be a permanent resident to this place."}
,{"e621":"1995968","text":"@User wanted to fuck somebody and they agreed to anything, even to wear a straitjacket. It seams they got their wish, but maybe not the way they wanted too."}
,{"e621":"1832872","text":"Poor @User agreed to have a bondage night fun with a random fellow from the club. But this person desires to keep them like this for 2-3 weeks."}
,{"e621":"1827053","text":"@User agreed to test out some new glue for a kinky industry. When presented with a straitjacket they agreed to wear it, not thinking twice, until given the task they need to perform. With the jacket and shackled legs, its going to be a long session testing out the glue stickiness."}
,{"e621":"1784440","text":"@User is regretting their choice saying yes to the spa staff. They remember reading the spa adv \"Come to our spa, you will relax. Leave the stressful world behind you for two days\", they never thought they would end up like this for 2 days."}
,{"e621":"1557648","text":"@User after getting caught ended up becoming an 'assistant' to one of the amusement parks entertainment. Don't worry about their worried look, its all part of the act."}
,{"e621":"1523848","text":"Asylum nurses need to ensure all patients are healthy. As such @User is getting a dildo that they need to push up their butt even if they wearing a straitjacket or get punished for failing to do their task. Its for their own good to have their ass stretched."}
,{"e621":"1501534","text":"@User had enough of the loneliness in their cell and is attempting an escape. Will be hard opening doors with the straitjacket on."}
,{"e621":"1498219","text":"@User was a bad kitty, as such they need a timeout. Gagged and straitjacket they will think twice before misbehaving."}
,{"e621":"1491207","text":"Jesters are skilled to make others laugh but it seams somebody made some improvement in @User jesters suit. Not only their arms is trapped, but they gagged as well. And all the struggling only makes it more fun to laugh at them."}
,{"e621":"1479092","text":"@User decided to have some fun with their straitjacket so ask the roomate to help them out. Too bad they remembered to turn on the tv to their favourite show after they already wearing their jacket and arms tightly tied. Oh and that their roomate has gone out, having nobody in the house to ask help."}
]