[
{"fa": "18213486","text": "@User taking a relaxing nap after eating all those food."}
,{"fa": "34006022","text": "Well we might have a different way to fest this holiday, as well as a different turkey to \"stuff\". But that fest is all about sharing and having a good time no, @User?"}
,{"fa":"25587426","text":"@User was invited to a Thanksgiving dinner, but nobody told them that they will be served as \"desert\". Don't think they mind it at all, after all its about sharing and having a good time."}
,{"fa":"25587426","text":"@User was invited to a Thanksgiving dinner, with tasty foods and great \"desert\" to enjoy an very long evening. Maybe they have after night \"desert\" too."}
,{"fa":"38733945","text":"A canadian invited @User to their Thanksgiving dinner, to experience fest from different cultures. After all, its all about sharing and having a good time no"}
,{"fa":"25678689","text":"@User gets invited to a Thanksgiving dinner. When they arrive at the hosts door a note says 'Door open, come in'. As they enter the lights are turned off, until they flip the switch. To @Users surprise the \"dinner\" is already ready, all lubed up and ready to \"eat\"."}
,{"fa":"21813891","text":"@User was invited to a Thanksgiving dinner. Oh boy what a wonderful \"dinner\" they had with lots of activities."}
,{"fa":"21762117","text":"@User is surprised and disturbed when they became the main event for the dinner."}
,{"fa":"34010578","text":"@User gets invited to help preparing Thanksgiving dinner. After all the turkey wont fill itself up all alone."}
,{"fa":"34010437","text":"@User gets invited to help preparing Thanksgiving dinner. As bad luck, they had no turkey to fill. Lucky they had @User to help out with the missing turkey."}
,{"fa":"12172651","text":"@User gets invited to help preparing Thanksgiving dinner. Preparing the \"turkey\" is not an easy job, especially with @User tied up doing an import job for this fest."}
,{"fa":"12172663","text":"@User \"eagerly\" and with \"joy\" helps in the turkey filling up."}
,{"fa":"12172681","text":"@User \"eagerly\" and with \"joy\" helps in the turkey filling up."}
,{"fa":"18306467","text":"@User decides wit ha friend to play out the act what happens on Thanksgiving day. Its a very fun act."}
,{"fa":"29440080","text":"When the market is fresh out of turkeys, you get the next best thing! Lucky @User was there to help out the Sergal."}
]